Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/runsc/nginx/target_count_21/repeat_1/21.txt
2020/01/24 00:21:34 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8021/
2020/01/24 00:22:04 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 26696 requests
Server Software:        nginx/1.17.7
Server Hostname:        192.168.3.100
Server Port:            8021
Document Path:          /
Document Length:        612 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      26696
Failed requests:        0
Total transferred:      22558353 bytes
HTML transferred:       16337952 bytes
Requests per second:    889.86 [#/sec] (mean)
Time per request:       112.377 [ms] (mean)
Time per request:       1.124 [ms] (mean, across all concurrent requests)
Transfer rate:          734.32 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3  18.2      1    1019
Processing:     1  109  99.9     67    1513
Waiting:        0  107  98.8     64    1512
Total:          1  111 102.5     71    1513
Percentage of the requests served within a certain time (ms)
  50%     71
  66%    168
  75%    208
  80%    218
  90%    243
  95%    262
  98%    289
  99%    321
 100%   1513 (longest request)
2020/01/24 00:22:04 Matched stat line [Connect:        0    3  18.2      1    1019 Connect 0 3 18.2 1 1019]
2020/01/24 00:22:04 Matched stat line [Processing:     1  109  99.9     67    1513 Processing 1 109 99.9 67 1513]
2020/01/24 00:22:04 Matched stat line [Waiting:        0  107  98.8     64    1512 Waiting 0 107 98.8 64 1512]
2020/01/24 00:22:04 Matched stat line [Total:          1  111 102.5     71    1513 Total 1 111 102.5 71 1513]
2020/01/24 00:22:04 Matched percentline [  50%     71 50 71]
2020/01/24 00:22:04 Matched percentline [  66%    168 66 168]
2020/01/24 00:22:04 Matched percentline [  75%    208 75 208]
2020/01/24 00:22:04 Matched percentline [  80%    218 80 218]
2020/01/24 00:22:04 Matched percentline [  90%    243 90 243]
2020/01/24 00:22:04 Matched percentline [  95%    262 95 262]
2020/01/24 00:22:04 Matched percentline [  98%    289 98 289]
2020/01/24 00:22:04 Matched percentline [  99%    321 99 321]
2020/01/24 00:22:04 Matched percentline [ 100%   1513 100 1513]
{"connect":{"max":1019,"mean":3,"median":1,"min":0,"stdDev":18.200000762939453},"percentiles":{"100":1513,"50":71,"66":168,"75":208,"80":218,"90":243,"95":262,"98":289,"99":321},"processing":{"max":1513,"mean":109,"median":67,"min":1,"stdDev":99.9000015258789},"total":{"max":1513,"mean":111,"median":71,"min":1,"stdDev":102.5},"waiting":{"max":1512,"mean":107,"median":64,"min":0,"stdDev":98.80000305175781}}